fe32/tutorials/rheoFoam/Contraction41/Oldroyd-BLog/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (-100 -4 0)
  (-1.6 -4 0)
  (-0.49 -4 0)
  (0 -4 0)
  (-100 -2.7 0)
  (-1.6 -2.7 0)
  (-0.49 -2.7 0)
  (0 -2.7 0)
  (-100 -1 0)
  (-1.6 -1 0)
  (-0.49 -1 0)
  (0 -1 0)
  (100 -1 0)
  (-100 -0.5 0)
  (-1.6 -0.5 0)
  (-0.49 -0.5 0)
  (0 -0.5 0)
  (100 -0.5 0)
  (-100 0.5 0)
  (-1.6 0.5 0)
  (-0.49 0.5 0)
  (0 0.5 0)
  (100 0.5 0)
  (-100 1 0)
  (-1.6 1 0)
  (-0.49 1 0)
  (0 1 0)
  (100 1 0)
  (-100 2.7 0)
  (-1.6 2.7 0)
  (-0.49 2.7 0)
  (0 2.7 0)
  (-100 4 0)
  (-1.6 4 0)
  (-0.49 4 0)
  (0 4 0) //35

 ///

  (-100 -4 1)
  (-1.6 -4 1)
  (-0.49 -4 1)
  (0 -4 1)
  (-100 -2.7 1)
  (-1.6 -2.7 1)
  (-0.49 -2.7 1)
  (0 -2.7 1)
  (-100 -1 1)
  (-1.6 -1 1)
  (-0.49 -1 1)
  (0 -1 1)
  (100 -1 1)
  (-100 -0.5 1)
  (-1.6 -0.5 1)
  (-0.49 -0.5 1)
  (0 -0.5 1)
  (100 -0.5 1)
  (-100 0.5 1)
  (-1.6 0.5 1)
  (-0.49 0.5 1)
  (0 0.5 1)
  (100 0.5 1)
  (-100 1 1)
  (-1.6 1 1)
  (-0.49 1 1)
  (0 1 1)
  (100 1 1)
  (-100 2.7 1)
  (-1.6 2.7 1)
  (-0.49 2.7 1)
  (0 2.7 1)
  (-100 4 1)
  (-1.6 4 1)
  (-0.49 4 1)
  (0 4 1) //71
   

);

blocks
(
    hex (0 1 5 4 36 37 41 40) (37 22 1) simpleGrading (0.007662197 54.76369924 1) //0
    hex (1 2 6 5 37 38 42 41) (12 22 1) simpleGrading (1 54.76369924 1) //1
    hex (2 3 7 6 38 39 43 42) (17 22 1) simpleGrading (0.047362592 54.76369924 1) //2
    hex (4 5 9 8 40 41 45 44) (37 31 1) simpleGrading (0.007662197 0.019415893 1) //3 
    hex (5 6 10 9 41 42 46 45) (12 31 1) simpleGrading (1 0.019415893 1) //4 
    hex (6 7 11 10 42 43 47 46) (17 31 1) simpleGrading (0.047362592 0.019415893 1) //5
    hex (8 9 14 13 44 45 50 49) (37 17 1) simpleGrading (0.007662197 21.11377675 1) //6
    hex (9 10 15 14 45 46 51 50) (12 17 1) simpleGrading (1 21.11377675 1) //7
    hex (10 11 16 15 46 47 52 51) (17 17 1) simpleGrading (0.047362592 21.11377675 1) //8
    hex (11 12 17 16 47 48 53 52) (45 17 1) simpleGrading (4105.448002 21.11377675 1) //9

    hex (13 14 19 18 49 50 55 54) (37 11 1) simpleGrading (0.007662197 1 1) //10
    hex (14 15 20 19 50 51 56 55) (12 11 1) simpleGrading (1 1 1) //11 
    hex (15 16 21 20 51 52 57 56) (17 11 1) simpleGrading (0.047362592 1 1) //12
    hex (16 17 22 21 52 53 58 57) (45 11 1) simpleGrading (4105.448002 1 1) //13

    hex (18 19 24 23 54 55 60 59) (37 17 1) simpleGrading (0.007662197 0.047362441 1) //14
    hex (19 20 25 24 55 56 61 60) (12 17 1) simpleGrading (1 0.047362441 1) //15
    hex (20 21 26 25 56 57 62 61) (17 17 1) simpleGrading (0.047362592 0.047362441 1) //16
    hex (21 22 27 26 57 58 63 62) (45 17 1) simpleGrading (4105.448002 0.047362441 1) //17
    hex (23 24 29 28 59 60 65 64) (37 31 1) simpleGrading (0.007662197 51.50419876 1) //18
    hex (24 25 30 29 60 61 66 65) (12 31 1) simpleGrading (1 51.50419876 1) //19
    hex (25 26 31 30 61 62 67 66) (17 31 1) simpleGrading (0.047362592 51.50419876 1) //20
    hex (28 29 33 32 64 65 69 68) (37 22 1) simpleGrading (0.007662197 0.018260271 1) //21
    hex (29 30 34 33 65 66 70 69) (12 22 1) simpleGrading (1 0.018260271 1) //22
    hex (30 31 35 34 66 67 71 70) (17 22 1) simpleGrading (0.047362592 0.018260271 1) //23
     
);

edges
(
);

boundary
(

inlet
     {
      type patch;
      faces
      (
            (0 4 40 36)
            (4 8 44 40)
            (8 13 49 44)
            (13 18 54 49)
            (18 23 59 54)
            (23 28 64 59)
            (28 32 68 64)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (26 27 63 62)
            (11 12 48 47)
          
            
        );
    }

    wall_vorttop
    {
        type wall;
        faces
        (
           
            (32 33 69 68)
            (33 34 70 69)
            (34 35 71 70)
            
        );
    }
    wall_liptop
    {
        type wall;
        faces
        (
            (26 31 67 62)
            (31 35 71 67)
            
            
        );
    }
    wall_lipdown
    {
        type wall;
        faces
        (
            (11 7 43 47) 
            (7 3 39 43)
           
            
        );
    }
     wall_vortdown
    {
        type wall;
        faces
        (
           
            (0 1 37 36)
            (1 2 38 37)
            (2 3 39 38)
            
            
        );
    }
  
    outlet
    {
        type patch;
        faces
        (
            (12 17 53 48)
            (17 22 58 53)
            (22 27 63 58)
            
            
        );
    }
   
   frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (4 5 9 8)
            (5 6 10 9)
            (6 7 11 10)
            (8 9 14 13)
            (9 10 15 14)
            (10 11 16 15)
            (11 12 17 16)
            (13 14 19 18)
            (14 15 20 19)
            (15 16 21 20)
            (16 17 22 21)
            (18 19 24 23)
            (19 20 25 24)
            (20 21 26 25)
            (21 22 27 26)
            (23 24 29 28)
            (24 25 30 29)
            (25 26 31 30)
            (28 29 33 32)
            (29 30 34 33)
            (30 31 35 34)
            
            (36 37 41 40)
            (37 38 42 41)
            (38 39 43 42)
            (40 41 45 44)
            (41 42 46 45)
            (42 43 47 46)
            (44 45 50 49)
            (45 46 51 50)
            (46 47 52 51)
            (47 48 53 52)
            (49 50 55 54)
            (50 51 56 55)
            (51 52 57 56)
            (52 53 58 57)
            (54 55 60 59)
            (55 56 61 60)
            (56 57 62 61)
            (57 58 63 62)
            (59 60 65 64)
            (60 61 66 65)
            (61 62 67 66)
            (64 65 69 68)
            (65 66 70 69)
            (66 67 71 70)           
        );
    }   
);

mergePatchPairs
(
);

// ************************************************************************* //
